//                      Что такое ООП?
//      Обьектно-ориентированное программирование(ООП)- методология программирования,
// основанная на представлении программы в виде совокупности обьектов,
// каждый из которых является экземпляром определенного класса, а классы образуют иерархию наследования.
//                  Перечислите основные парадигмы ООП?
// Инкапсуляция Наследование Полиморфизм (ИНП)
// 1. Инкапсуляция - сокрытие реализации. В java она достигается при помощи модификаторов доступа.
// Разработчик делает открытыми(публичными) только те методы, которые должны быть доступны за пределами класса.(Пример из жизни - автомобиль(человек управляет машиной не видя весь процесс управления автомобилем) использует только руль и тд)
// 2. Наследование - процесс, благодаря которому один обьект приобретает свойства другого, при этом может иметь черты, характерные только для него.(Пример из жизни класс семейства кошачих)
// 3. Полиморфизм - один интерфейс множество реализаций(Пример из жизни машина дорогая и дешевая у обоих одинаково заводите двигатель)
//
//


public class Основные_Парадигмы_ООП {
    public static void main() {

    }
}
